openclaw/esp-openclaw-node/examples/waveshare-esp32-s3-touch-amoled-2.06-room-node/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_SR_WN_WN9_HIESP=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_USE_CLIB_MALLOC=y
# The BSP's default 100-row LVGL buffer (410x100x2 = 82 KiB) is allocated from
# the default heap, which lands in PSRAM. The QSPI panel cannot DMA from PSRAM,
# so esp_lcd bounces every flush through an equally large internal allocation.
# Once Wi-Fi/TLS and audio are up that allocation fails and flushes are dropped,
# leaving the panel garbled or dark. Keep the flush chunk small (16 rows is
# ~13 KiB) and reserve enough internal memory that the bounce always succeeds.
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=16
# Task stacks and DMA can only come from internal RAM, and with the 256-byte
# always-internal threshold nothing else needs it; give them the whole budget.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_USE_SNAPSHOT=y
# esp_new_jpeg decodes straight into LVGL draw buffers; its output buffer must
# be 16-byte aligned. Stride align stays 1 so RGB565 rows are tightly packed.
CONFIG_LV_DRAW_BUF_ALIGN=16
# Two node clients (node + operator role) each run a component task and a
# websocket task, and all four stacks must be internal RAM. 12 KiB each cost
# 48 KiB of the scarcest pool and starved websocket task creation once the
# always-on audio pipeline was added; 8 KiB matches the IDF default.
CONFIG_ESP_OPENCLAW_NODE_TASK_STACK_SIZE=8192
CONFIG_ESP_OPENCLAW_NODE_TRANSPORT_TASK_STACK_SIZE=8192
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# PSRAM-first memory policy, matching every esp-webrtc-solution demo config
# (openai_demo etc.): Wi-Fi/LWIP buffers and mbedTLS allocations in PSRAM and a
# 256-byte always-internal threshold. Without these, DTLS peer setup and the
# websocket task fail internal-heap allocation once display + audio are up.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# During a call the audio pipeline runs at priority 10-20 on both cores and a
# priority-5 node/websocket task starves entirely: node.invoke (face.set,
# talk.stop) times out for the whole call. 11 sits above the bulk encoder
# workers but below the latency-critical capture (15) and peer (18) tasks;
# command handling is microsecond-scale JSON work.
CONFIG_ESP_OPENCLAW_NODE_TASK_PRIORITY=11
CONFIG_ESP_OPENCLAW_NODE_TRANSPORT_TASK_PRIORITY=11
